{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Allergy",
    "1": "Anemia",
    "2": "Anxiety",
    "3": "Arthritis",
    "4": "Asthma",
    "5": "Bronchitis",
    "6": "COVID-19",
    "7": "Chronic Kidney Disease",
    "8": "Common Cold",
    "9": "Dementia",
    "10": "Depression",
    "11": "Dermatitis",
    "12": "Diabetes",
    "13": "Epilepsy",
    "14": "Food Poisoning",
    "15": "Gastritis",
    "16": "Heart Disease",
    "17": "Hypertension",
    "18": "IBS",
    "19": "Influenza",
    "20": "Liver Disease",
    "21": "Migraine",
    "22": "Obesity",
    "23": "Parkinson's",
    "24": "Pneumonia",
    "25": "Sinusitis",
    "26": "Stroke",
    "27": "Thyroid Disorder",
    "28": "Tuberculosis",
    "29": "Ulcer"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Allergy": 0,
    "Anemia": 1,
    "Anxiety": 2,
    "Arthritis": 3,
    "Asthma": 4,
    "Bronchitis": 5,
    "COVID-19": 6,
    "Chronic Kidney Disease": 7,
    "Common Cold": 8,
    "Dementia": 9,
    "Depression": 10,
    "Dermatitis": 11,
    "Diabetes": 12,
    "Epilepsy": 13,
    "Food Poisoning": 14,
    "Gastritis": 15,
    "Heart Disease": 16,
    "Hypertension": 17,
    "IBS": 18,
    "Influenza": 19,
    "Liver Disease": 20,
    "Migraine": 21,
    "Obesity": 22,
    "Parkinson's": 23,
    "Pneumonia": 24,
    "Sinusitis": 25,
    "Stroke": 26,
    "Thyroid Disorder": 27,
    "Tuberculosis": 28,
    "Ulcer": 29
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.56.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
